; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	image1 - mode
	Star1 - direction
	Star0 - direction
	Star4 - direction
	Star5 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star16)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
	(supports instrument2 image1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star4)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star3)
	(supports instrument7 image1)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite1 Star1)
	(have_image Phenomenon6 image1)
	(have_image Star7 spectrograph0)
	(have_image Star8 image1)
	(have_image Phenomenon9 image1)
	(have_image Phenomenon10 spectrograph2)
	(have_image Star11 spectrograph2)
	(have_image Star12 image1)
	(have_image Star13 spectrograph0)
	(have_image Phenomenon14 spectrograph2)
	(have_image Planet15 spectrograph0)
	(have_image Star16 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star3 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star3)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 planet15 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet15)
   goals met: 0 of 13
5. (take_image satellite0 planet15 instrument0 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 1 of 13
6. (turn_to satellite0 phenomenon9 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 13
7. (take_image satellite0 phenomenon9 instrument0 image1)
   added: (have_image phenomenon9 image1)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon14 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon14 instrument0 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 4 of 13
12. (turn_to satellite0 phenomenon10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 13
13. (take_image satellite0 phenomenon10 instrument0 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 13
14. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 5 of 13
15. (take_image satellite0 star11 instrument0 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 6 of 13
16. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 6 of 13
17. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 7 of 13
18. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 7 of 13
19. (take_image satellite0 star13 instrument0 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 8 of 13
20. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 8 of 13
21. (take_image satellite0 star16 instrument0 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 9 of 13
22. (turn_to satellite0 star7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star7)
   goals met: 9 of 13
23. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 10 of 13
24. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 11 of 13
25. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 12 of 13
26. (turn_to satellite1 star1 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star1)
   goals met: 13 of 13
